---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.#ctor
source: html/48d650b3-75ff-ab01-b5fc-e0a59a25514a.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.#ctor Method

Initializes a new instance of the SlabShapeVertexArray class

## Syntax (C#)
```csharp
public SlabShapeVertexArray()
```